// core.js v3.5.2
/* exported pzpr */

//----------------------------------------------------------------------------
// ★pzprオブジェクト
//---------------------------------------------------------------------------
/* extern */
window.pzpr = {
	version : '<%= pkg.version %>',

	EDITOR : false,	// エディタモード
	PLAYER : true,	// playerモード

	//---------------------------------------------------------------
	// パズルを生成する
	//---------------------------------------------------------------
	createPuzzle : function(canvas, option){
		return new pzpr.Puzzle(canvas, option);
	}
};
